# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

### Load Required Libraries

In [ ]:
!pip install MySQL-connector-python
import mysql.connector
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [ ]:
import mysql.connector
  
connection = mysql.connector.connect(host ="localhost",
                                    user ="root",
                                    passwd ="T@mmy021")
 
print(connection)
  
## closing the connection
connection.close()

### You are required to create a database named 'e_commerce'

In [ ]:
## Lets make a connection to Mysql server and perform some operations
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="T@mmy021")
 
## creating a cursor object
cursorObject = connection.cursor()
 
## creating database
cursorObject.execute("CREATE DATABASE e_commerce")

## closing the connection after creating a database('e_commerce')
connection.close()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [ ]:
## Connect to Mysql server and choose the database while connecting to the server
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="T@mmy021",
                                     database = "e_commerce")

# creating a cursor object
cursorObject = connection.cursor()
print(connection)

table_creation_query = """create table `supplier`(SUPP_ID int primary key, SUPP_NAME varchar(50),
                          SUPP_CITY varchar(50), SUPP_PHONE varchar(10));

                          create table `customer`(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, 
                          CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID));

                          create table `category`(CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID));

                          create table `product`(PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, 
                          CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));

                          create table `product_details`(PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
                          PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), 
                          FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));

                          create table `order`(ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL,
                          PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));
                          
                          create table `rating`(RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, 
                          RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),
                          FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID));"""

                   
                  
# Executing the query
cursorObject.execute(table_creation_query)

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [ ]:
# insert into "supplier" table
## Inserting data into "supplier"

connection.close()

## Connect to Mysql server and choose the database('e_commerce') while connecting to the server
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="T@mmy021",
                                     database = "e_commerce")

# creating a cursor object
cursorObject = connection.cursor()
print(connection)

insert_supplier = """INSERT INTO SUPPLIER (SUPP_ID , SUPP_NAME, SUPP_CITY, SUPP_PHONE) 
                       VALUES (%s, %s, %s, %s)"""

val = [(1,'Rajesh Retails','Delhi','1234567890'),
(2,'Appario Ltd.','Mumbai','2589631470'),
(3,'Knome products','Banglore','9785462315'),
(4,'Bansal Retails','Kochi','8975463285'),
(5,'Mittal Ltd.','Lucknow','7898456532')]

cursorObject.executemany(insert_supplier, val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [ ]:
# insert into "customer" table
connection.close()

## Connect to Mysql server and choose the database('e_commerce') while connecting to the server
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="T@mmy021",
                                     database = "e_commerce")

# creating a cursor object
cursorObject = connection.cursor()
print(connection)

insert_customer = """INSERT INTO CUSTOMER (CUS_ID , CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER) 
                       VALUES (%s, %s, %s, %s, %s)"""

val = [(1,'AAKASH','9999999999','DELHI','M'),
(2,'AMAN','9785463215','NOIDA','M'),
(3,'NEHA','9999999999','MUMBAI','F'),
(4,'MEGHA','9994562399','KOLKATA','F'),
(5,'PULKIT','7895999999','LUCKNOW','M')]

cursorObject.executemany(insert_customer, val)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [ ]:
# insert into "categoty" table
## Inserting data into "CATEGORY"

connection.close()

## Connect to Mysql server and choose the database('e_commerce') while connecting to the server
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="T@mmy021",
                                     database = "e_commerce")

# creating a cursor object
cursorObject = connection.cursor()
print(connection)

insert_category = """INSERT INTO CATEGORY (CAT_ID , CAT_NAME) 
                       VALUES (%s, %s)"""

val = [  ( 1,'BOOKS'),
  (2,'GAMES'),
  (3,'GROCERIES'),
   (4,'ELECTRONICS'),
  (5,'CLOTHES')]

cursorObject.executemany(insert_category, val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [ ]:
# insert into "product" table
## Inserting data into "PRODUCT"

connection.close()

## Connect to Mysql server and choose the database('e_commerce') while connecting to the server
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="T@mmy021",
                                     database = "e_commerce")

# creating a cursor object
cursorObject = connection.cursor()
print(connection)

insert_product = """INSERT INTO PRODUCT(PRO_ID ,PRO_NAME, PRO_DESC, CAT_ID) 
                       VALUES (%s, %s, %s, %s)"""

val = [(1,'GTA V','DFJDJFDJFDJFDJFJF',2),
(2,'TSHIRT','DFDFJDFJDKFD',5),
(3,'ROG LAPTOP','DFNTTNTNTERND',4),
(4,'OATS','REURENTBTOTH',3),
(5,'HARRY POTTER','NBEMCTHTJTH',1)]

cursorObject.executemany(insert_product, val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [ ]:
# insert into "product_details" table
## Inserting data into "product_details"

connection.close()

## Connect to Mysql server and choose the database('e_commerce') while connecting to the server
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="T@mmy021",
                                     database = "e_commerce")

# creating a cursor object
cursorObject = connection.cursor()
print(connection)

insert_product_details = """INSERT INTO product_details(PROD_ID, PRO_ID ,SUPP_ID, PROD_PRICE) 
                       VALUES (%s, %s, %s, %s)"""

val = [(1,1,2,1500),
(2,3,5,30000),
(3,5,1,3000),
(4,2,3,2500),
(5,4,1,1000)]

cursorObject.executemany(insert_product_details, val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [ ]:
# insert into "orders" table
#  HAVE USED `order` instead of orders as in the TABLE NAMES GIVEN IN Q1, NAME IS ORDER. ASKED THIS TO FACULTY DURING LAB SESSION AND THEY ARE FINE WITH ORDER INSTEAD OF ORDERS. 

## Inserting data into "order"

connection.close()

## Connect to Mysql server and choose the database('e_commerce') while connecting to the server
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="T@mmy021",
                                     database = "e_commerce")

# creating a cursor object
cursorObject = connection.cursor()
print(connection)

insert_order = """INSERT INTO `order`(ORD_ID, ORD_AMOUNT ,ORD_DATE, CUS_ID, PROD_ID) 
                       VALUES (%s, %s, %s, %s, %s)"""

val = [(20,1500,'2021-10-12',3,5),
(25,30500,'2021-09-16',5,2),
(26,2000,'2021-10-05',1,1),
(30,3500,'2021-08-16',4,3),
(50,2000,'2021-10-16',2,1)]

cursorObject.executemany(insert_order, val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [ ]:
# insert into "rating" table
## Inserting data into "rating"

connection.close()

## Connect to Mysql server and choose the database('e_commerce') while connecting to the server
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="T@mmy021",
                                     database = "e_commerce")

# creating a cursor object
cursorObject = connection.cursor()
print(connection)

insert_rating = """INSERT INTO RATING(RAT_ID, CUS_ID ,SUPP_ID, RAT_RATSTARS) 
                       VALUES (%s, %s, %s, %s)"""

val = [(1,2,2,4),
(2,3,4,3),
(3,5,1,5),
(4,1,3,2),
(5,4,5,4)]

cursorObject.executemany(insert_rating, val)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [23]:
connection.close()

## Connect to Mysql server and choose the database('e_commerce') while connecting to the server
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="T@mmy021",
                                     database = "e_commerce")

# creating a cursor object
cursorObject = connection.cursor()
print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001F4BFE53970>

In [6]:
Q3 = """select customer.cus_gender,count(customer.cus_gender) as count 
            from customer inner join `order` on customer.cus_id=`order`.cus_id 
            where `order`.ord_amount>=3000 group by customer.cus_gender;"""
cursorObject.execute(Q3)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns=['Gender', 'Count'])
output_df

  Gender  Count
0      M      1
1      F      1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [26]:
Q4 = """select o.ORD_ID,o.ORD_AMOUNT,o.ORD_DATE,o.CUS_ID,o.PROD_ID,p.PRO_NAME from `order` o 
    inner join product_details pd on o.PROD_ID=pd.PROD_ID 
    inner join product p on p.PRO_ID=pd.PRO_ID group by CUS_ID having CUS_ID=2; """
cursorObject.execute(Q4)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns=['Order_Id','Order_Amount','Order_Date','Customer_Id','Product_Id','Product_Name'])
output_df

   Order_Id  Order_Amount  Order_Date  Customer_Id  Product_Id Product_Name
0        50          2000  2021-10-16            2           1        GTA V

In [38]:
# ALTERNATE SOLUTION TO DISPLAY PRODUCT NAME FOR CUSTOMER ID 2. 

Q4 = """select * from product where pro_id = (select product_details.pro_id from product_details inner join `order` on
        `order`.prod_id = product_details.prod_id where `order`.cus_id = 2); """
cursorObject.execute(Q4)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns=['Product_Id', 'Product_Name', 'Product_Description', 'Category_Id'])
output_df

   Product_Id Product_Name Product_Description  Category_Id
0           1        GTA V   DFJDJFDJFDJFDJFJF            2

### Q5) Display the Supplier details who can supply more than one product.

In [39]:
Q5 = """select supplier.* from supplier inner join product_details on product_details.supp_id = supplier.supp_id group by 
          product_details.supp_id having count(product_details.supp_id)>1;"""
cursorObject.execute(Q5)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns=['Supplier_id', 'Supplier_Name', 'Supplier_City', 'Supplier_Phone'])
output_df

   Supplier_id   Supplier_Name Supplier_City Supplier_Phone
0            1  Rajesh Retails         Delhi     1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [43]:
Q6 = """select o.ORD_AMOUNT, c.CAT_ID,c.CAT_NAME from `order` o
                   inner join product_details pd on o.PROD_ID=pd.PROD_ID 
                   inner join product p on p.PRO_ID=pd.PRO_ID
                   inner join category c on c.CAT_ID=p.PRO_ID 
                   having min(o.ORD_AMOUNT);"""

cursorObject.execute(Q6)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns=["Order_Amount","Category_id", 'Category_Name'])
output_df

   Order_Amount  Category_id Category_Name
0          1500            4   ELECTRONICS

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [41]:
Q7 = """select pro_id, pro_name from product where pro_id in (select product_details.pro_id from `order` inner join
          product_details on `order`.prod_id = product_details.prod_id where `order`.ord_date > '2021-10-05');"""
cursorObject.execute(Q7)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns = ['Product_id', 'Product_Name'])
output_df

   Product_id Product_Name
0           1        GTA V
1           4         OATS

In [29]:
#ALTERNATE SOLUTION 
Q7 = """select p.PRO_ID,p.PRO_NAME,o.ORD_DATE from `order` o 
                 inner join product_details pd on pd.PROD_ID=o.PROD_ID 
                 inner join product p on p.PRO_ID=pd.PRO_ID 
                 having o.ORD_DATE>'2021-10-05';"""
cursorObject.execute(Q7)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns = ['Product_ID','Product_name','Order_Date'])
output_df

   Product_ID Product_name  Order_Date
0           4         OATS  2021-10-12
1           1        GTA V  2021-10-16

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [31]:
Q8 = """select supplier.supp_id, supplier.supp_name, customer.cus_name, rating.rat_ratstars from ((rating
          inner join supplier on rating.supp_id = supplier.supp_id) inner join customer on 
          rating.cus_id = customer.cus_id ) order by rat_ratstars desc limit 3;"""
cursorObject.execute(Q8)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns=['Supplier_Id', 'Supplier_Name', 'Customer_Name', 'Ratings'])
output_df

   Supplier_Id   Supplier_Name Customer_Name  Ratings
0            1  Rajesh Retails        PULKIT        5
1            2    Appario Ltd.          AMAN        4
2            5     Mittal Ltd.         MEGHA        4

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [32]:
Q9 = """select cus_name, cus_gender from customer where cus_name like 'A%' or cus_name like '%A';"""
cursorObject.execute(Q9)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns=['Customer_Name', 'Customer_Gender'])
output_df

  Customer_Name Customer_Gender
0        AAKASH               M
1          AMAN               M
2          NEHA               F
3         MEGHA               F

### Q10) Display the total order amount of the male customers.

In [33]:
Q10 = """select sum(`order`.ord_amount) as Total_Order_Amount from `order` where cus_id in
          (select cus_id from customer where CUS_GENDER = 'M');"""
cursorObject.execute(Q10)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns=['Total_Order_Amount'])
output_df

  Total_Order_Amount
0              34500

### Q11) Display all the Customers left outer join with  the orders

In [35]:
Q11 = """select customer.*, `order`.ord_id, `order`.ord_amount, `order`.ord_date, `order`.prod_id
          from customer left outer join `order` on customer.cus_id = `order`.cus_id;"""
cursorObject.execute(Q11)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns=['Customer_Id', 'Customer_Name', 'Customer_Phone', 'Customer_City', 'Customer_Gender', 'Order_Id',
                                          'Order_Amount', 'Order_Date', 'Prod_id' ])
output_df

,Customer_Id,Customer_Name,Customer_Phone,Customer_City,Customer_Gender,Order_Id,Order_Amount,Order_Date,Prod_id
0,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-16,1
2,3,NEHA,9999999999,MUMBAI,F,20,1500,2021-10-12,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,2

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)